name: "CaffeNet"
layer {
  name: "data"
  type: "DocData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  doc_data_param {
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/256x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/304x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/352x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/400x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/448x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/496x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x288_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x336_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x384_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x432_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x480_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/272x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/320x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/368x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/416x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/464x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x256_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x304_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x352_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x400_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x448_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x496_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/288x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/336x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/384x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/432x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/480x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x272_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x320_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x368_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x416_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x464_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_train/512x512_lmdb"

	enforce_epochs: true
	weights_by_size: true

    batch_size: 256
    backend: LMDB
	label_names: "collection"
  }
}
layer {
  name: "data"
  type: "DocData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  doc_data_param {
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/256x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/304x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/352x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/400x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/448x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/496x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x288_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x336_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x384_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x432_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x480_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/272x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/320x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/368x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/416x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/464x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x256_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x304_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x352_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x400_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x448_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x496_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/288x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/336x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/384x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/432x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/480x512_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x272_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x320_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x368_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x416_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x464_lmdb"
    sources: "/data/lmdb/doc_datum/andoc-1m/color_collection/512l_val/512x512_lmdb"

    # needs 405 iterations with batch_size = 128 and  in_order and no_wrap
    batch_size: 128
	in_order: true
	no_wrap: true
    backend: LMDB
	label_names: "collection"
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 15
	pad: 7
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 4
    kernel_size: 9
	stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "SPP"
  bottom: "conv5"
  top: "pool5"
  spp_param {
    pyramid_height: 3
    pool: MAX
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1162
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "accuracy-5"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy-5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss"
}
